
"""
     = set Mapped[List[]] when relation to 'MANY'
          => we have 'MANY' of items in 'ONE' category
          => 'MANY' have FK then without List[]
          
     = set Mapped[class name] without List[] when relation to 'ONE' 
          => we have 'ONE' category for 'MANY' items
          => other side:'ONE' with List[]

     = One → Many(parent) put ((cascade = delete, Just when List[] وليس دائما))
          -> لو حذفت جدول المرجع back_populates اي هيحصل؟
          => عند حذف فئة تحذف كل المنتجات المرتبطة بها لانها في علاقة
     = Many → One(child) without cascade
          => بدونها عند حذف شئ يحذف لوحده فقط

الفكرة انه لا يوجد تطبيق app driver , ولا نستطيع ان نجعل الادمن يقوم بتعديل الحاله دائماً
ما الحلول و الاقتراحات 
-> يعني عايزين الطلب الادمن يقدر يعينه على سائق معين ثم بعد توصيله يغير الادمن الحاله انه متاح (تم توصيل الطلب بالفعل) ثم طلب جديد يرى الادمن من متاح من السائقين و يعينه عيله و هكذا
يعني السائق يستطيع تغيير الحاله فقط (يظهر هذا بالفعل للادمن), اي نضيف وقت التوصيل المستغرق منذ بدأ تغيير الحاله الى (on_delivery) حتى ينتهي 
---
اذا ممكن نعطي لينك dashbord بسيط لكل السائقين بدل التطبيق 
صحيح ؟
---
هل هذه المهمة هي في الجدول الحالي او في جدول اخر (order) كما  بالصورة 
ناقش معي خطة التنفيذ قبل تنفيذ اي كود

نبدأ خطوة صغيرة بخطوة صغيرة حتى لا تتعقد الامور و حتى افهم ما يحدث
لا تنفذ الا عندما اخبرك
سنبني order model اولاً جدول في قاعدة البيانات مثل الباقي
"""